package csd.uoc.gr.A25;

interface Combatant{

    /**
     * Επιτίθεται σε έναν αντίπαλο, ο οποίος θα πρέπει και αυτός να είναι
     * Combatant. Φυσικά, μια οντότητα δε μπορεί να επιτεθεί στον εαυτό
     * της. O Combatant που κάνει την επίθεση θα πρέπει να έχει
     * κατάσταση > 0.
     * Στο τέλος της επίθεσης θα πρέπει να τυπώνεται ότι η τρέχουσα
     * οντότητα (με το όνομά της) επιτέθηκε στον adversary (με το όνομά
     * του), καθώς και η νέα κατάσταση του adversary.
     * Μετά την επίθεση, η κατάσταση του adversary θα πρέπει να είναι
     * μικρότερη από την προηγούμενή του κατάσταση.
     * @param adversary Jedi or Sith
     */
    void attack(Object adversary);

    /**
     * @return Επιστρέφει το αν η οντότητα έχει ηττηθεί (δηλαδή η κατάστασή της
     * είναι 0)
     */
    boolean isDefeated();

    /**
     * @return Επιστρέφει την κατάσταση της οντότητας, η
     * οποία ορίζεται στο [0,10]
     */
    int getCondition();

    /**
     * Αναθέτει την κατάσταση της οντότητας, η
     * οποία ορίζεται στο [0,10]
     * @param condition Combatant condition
     */
    void setCondition(int condition);

    /**
     * @return Επιστρέφει το όνομα το οποίο χρησιμοποιεί η οντότητα στη μάχη
     */
    String getCallSign();
}

